In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
    "Date": pd.date_range(start="2023-01-01", periods=30),
    
    "Product": np.random.choice(["Laptop", "Mobile", "Tablet", "Headphones"], 30),
    
    "Region": np.random.choice(["North", "South", "East", "West"], 30),
    
    "Sales": np.random.randint(5000, 50000, 30),
    
    "Units": np.random.randint(1, 20, 30),
    
    "Sales_Person": np.random.choice(
        ["Ali", "Ahmed", "Sara", "Ayesha", "Bilal"], 30
    ),
}

df = pd.DataFrame(data)

# Extra useful columns
df["Month"] = df["Date"].dt.month_name()
df["Quarter"] = "Q" + df["Date"].dt.quarter.astype(str)

df

         Date     Product Region  Sales  Units Sales_Person    Month Quarter
0  2023-01-01      Tablet   East  22431     15          Ali  January      Q1
1  2023-01-02      Laptop  South   5674     19        Ahmed  January      Q1
2  2023-01-03      Mobile   East  36973      9       Ayesha  January      Q1
3  2023-01-04      Mobile   East  49573      1        Bilal  January      Q1
4  2023-01-05      Mobile  South  39599      1        Bilal  January      Q1
5  2023-01-06      Laptop   East  35253     13         Sara  January      Q1
6  2023-01-07      Laptop   East  10529     15        Ahmed  January      Q1
7  2023-01-08      Mobile   East  38742     16       Ayesha  January      Q1
8  2023-01-09  Headphones  North  26324     15          Ali  January      Q1
9  2023-01-10  Headphones  North  32352     19          Ali  January      Q1
10 2023-01-11      Mobile   West  24654      8        Bilal  January      Q1
11 2023-01-12      Mobile  South   6310      2         Sara  January      Q1
12 2023-01-13  Headphones  South  13974     16         Sara  January      Q1
13 2023-01-14  Headphones  South  20565     14          Ali  January      Q1
14 2023-01-15      Mobile   East  30691     13         Sara  January      Q1
15 2023-01-16      Mobile  North  27491      5        Ahmed  January      Q1
16 2023-01-17      Laptop  South  26740      1        Ahmed  January      Q1
17 2023-01-18  Headphones  South  48608      5         Sara  January      Q1
18 2023-01-19      Mobile   West  35495     11       Ayesha  January      Q1
19 2023-01-20      Mobile  South  26425     11         Sara  January      Q1
20 2023-01-21      Tablet  South  47930     17         Sara  January      Q1
21 2023-01-22      Mobile   West  26208     11       Ayesha  January      Q1
22 2023-01-23      Mobile   West  13113      3        Bilal  January      Q1
23 2023-01-24      Tablet  South  49188      6        Ahmed  January      Q1
24 2023-01-25  Headphones   West  38957     13        Bilal  January      Q1
25 2023-01-26  Headphones  South  38069      9       Ayesha  January      Q1
26 2023-01-27  Headphones   East   7995     18        Bilal  January      Q1
27 2023-01-28      Mobile  North  33717     10         Sara  January      Q1
28 2023-01-29      Mobile  South  43511      2          Ali  January      Q1
29 2023-01-30      Mobile   West   8449     10        Ahmed  January      Q1

# Pivot Table

In [16]:
pd.pivot_table(df, values = "Sales", index = "Region", columns = "Product")

Product  Headphones   Laptop    Mobile   Tablet
Region
East         7995.0  22891.0  38994.75  22431.0
North       29338.0      NaN  30604.00      NaN
South       30304.0  16207.0  28961.25  48559.0
West        38957.0      NaN  21583.80      NaN

In [20]:
pd.pivot_table(df, values = "Sales", index = "Region", columns = "Product",aggfunc = "count")

Product  Headphones  Laptop  Mobile  Tablet
Region
East            1.0     2.0     4.0     1.0
North           2.0     NaN     2.0     NaN
South           4.0     2.0     4.0     2.0
West            1.0     NaN     5.0     NaN

In [22]:
pd.pivot_table(df, values = ["Sales", "Units"], index = "Product", columns = "Sales_Person")

                     Sales                                             \
Sales_Person         Ahmed           Ali   Ayesha     Bilal      Sara
Product
Headphones             NaN  26413.666667  38069.0  23476.00  31291.00
Laptop        14314.333333           NaN      NaN       NaN  35253.00
Mobile        17970.000000  43511.000000  34354.5  31734.75  24285.75
Tablet        49188.000000  22431.000000      NaN       NaN  47930.00

                  Units
Sales_Person      Ahmed   Ali Ayesha  Bilal  Sara
Product
Headphones          NaN  16.0   9.00  15.50  10.5
Laptop        11.666667   NaN    NaN    NaN  13.0
Mobile         7.500000   2.0  11.75   3.25   9.0
Tablet         6.000000  15.0    NaN    NaN  17.0

In [25]:
pivot2 = pd.pivot_table(df, values = "Sales", index = "Product", columns = "Sales_Person", aggfunc = "sum")
pivot2.fillna(0)

Sales_Person    Ahmed      Ali    Ayesha     Bilal     Sara
Product
Headphones        0.0  79241.0   38069.0   46952.0  62582.0
Laptop        42943.0      0.0       0.0       0.0  35253.0
Mobile        35940.0  43511.0  137418.0  126939.0  97143.0
Tablet        49188.0  22431.0       0.0       0.0  47930.0

# Cross Tab

In [28]:
pd.crosstab(df["Region"],df["Product"])

Product  Headphones  Laptop  Mobile  Tablet
Region
East              1       2       4       1
North             2       0       2       0
South             4       2       4       2
West              1       0       5       0